src/InformationRegisters/рмкСтатусыСообщений/рмкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рмкСтатусыСообщений</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </resources>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <types>CatalogRef.рмкВходящиеСообщения</types>
      <types>CatalogRef.рмкИсходящиеСообщения</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/рмкСпособыСериализации/рмкСпособыСериализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рмкСпособыСериализации</name>
  <enumValues>
    <name>ПлатформеннаяСериализация</name>
  </enumValues>
  <enumValues>
    <name>МетодВстроенногоМенеджера</name>
  </enumValues>
  <enumValues>
    <name>МетодПодключаемогоМенеджера</name>
  </enumValues>
</mdclass:Enum>

src/Enums/рмкСтатусыСообщений/рмкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рмкСтатусыСообщений</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Получено</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рмкТочкиПодключения/рмкТочкиПодключения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкТочкиПодключения</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособСериализации</name>
    <type>
      <types>EnumRef.рмкСпособыСериализации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетодаСериализации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/рмкИсходящиеСообщения/рмкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкИсходящиеСообщения</name>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключения</name>
    <type>
      <types>CatalogRef.рмкТочкиПодключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/рмкОбработкаСообщений/Module.bsl
Процедура ОбработатьВходящиеСообщения(ВходящиеСообщения) Экспорт
	
	МенеджерыКонвертации = СоздатьМенеджерыКонвертации();

	Для Каждого Сообщение Из ВходящиеСообщения Цикл
		
		МенеджерКонвертации = МенеджерыКонвертации.Получить(Сообщение.СпособСериализации);
		ДанныеДляРаспаковки = Сообщение.Данные.Получить();
		
		Если ДанныеДляРаспаковки = Неопределено Тогда
			// TODO записать статус сообщения с ошибкой
			Продолжить;
		КонецЕсли;	
		
		КонтейнерСообщения = ДесериализоватьОбъект(ДанныеДляРаспаковки);
		
		Если МенеджерКонвертации = Неопределено Тогда
			ОбъектДляЗаписи = КонтейнерСообщения; // специально не преобразуем объект
		Иначе	
			ОбъектДляЗаписи = МенеджерыКонвертации.ВыполнитьМетод(Сообщение.ИмяМетодаСериализации, КонтейнерСообщения);
		КонецЕсли;
		
		// или же вынести бизнес-логику записи объекта в менеджер. так удобнее
		Если ОбъектДляЗаписи <> Неопределено Тогда
			
			Попытка
				ОбъектДляЗаписи.ОбменДанными.Загрузка = Истина;
				ОбъектДляЗаписи.Записать();
			Исключение
				// TODO записать статус сообщения с ошибкой
			КонецПопытки;
				
		Иначе
			// TODO записать статус сообщения с другой ошибкой		
		КонецЕсли;			
			
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыполнитьОтложенноеПроведениеДокументов() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПолучитьСообщенияИзОчередей() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОчиститьУстаревшиеСообщения() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция ПолучитьОбработчикСообщения(Сообщение)
	
	Если Сообщение.СпособДесериализации = ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодВстроенногоМенеджера") Тогда
		МенеджерКонвертации = Обработки.рмкМенеджерКонвертации.Создать();	
	ИначеЕсли Сообщение.СпособДесериализации = ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодПодключаемогоМенеджера") Тогда
		
		ПодключитьВнешнююОбработкуМенеджераКонвертации();
		МенеджерКонвертации = ВнешниеОбработки.рмкМенеджерКонвертации.Создать();			
				
	Иначе
		ВызватьИсключение "Неправильный тип сериализации в сообщении";
	КонецЕсли;
	
КонецФункции	

Procedure ПриЗаписиОбъектаРепликации(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// TODO
	// возможно, тут есть смысл запустить фоновое задание по созданию исходящего сообщения
	Для Каждого ТочкаПодключения Из ТочкиПодключенияДляОбъекта(Источник) Цикл
		СоздатьИсходящееСообщение(Источник, ТочкаПодключения);
	КонецЦикла;	
	
EndProcedure

Функция ТочкиПодключенияДляОбъекта(Источник)
	
	ПолноеИмяМетаданных = Источник.Метаданные().ПолноеИмя();
	ТочкиПодключения 	= Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рмкТочкиПодключения.Ссылка Как ТочкаПодключения
	|ИЗ
	|	Справочник.рмкТочкиПодключения КАК рмкТочкиПодключения
	|ГДЕ
	|	рмкТочкиПодключения.ПолноеИмяМетаданных = &ПолноеИмяМетаданных
	|	И НЕ рмкТочкиПодключения.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПолноеИмяМетаданных", ПолноеИмяМетаданных);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТочкиПодключения.Добавить(Выборка.ТочкаПодключения);
	КонецЦикла;	
	
	Возврат ТочкиПодключения;
	
КонецФункции	

Процедура СоздатьИсходящееСообщение(ОбъектДляСериализации, ТочкаПодключения)
	
	ID = Новый УникальныйИдентификатор;
	РеквизитыТочки = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(ТочкаПодключения, "Сервер,ВиртуальныйХост");
	
	СообщениеОбъект = Справочники.рмкИсходящиеСообщения.СоздатьЭлемент();
	СообщениеОбъект.ТекущийСтатус 		= ПредопределенноеЗначение("Перечисление.рмкСтатусыСообщений.Создано");
	СообщениеОбъект.Сервер 				= РеквизитыТочки.Сервер;
	СообщениеОбъект.ТочкаПодключения 	= ТочкаПодключения;
	СообщениеОбъект.ВиртуальныйХост 	= РеквизитыТочки.ВиртуальныйХост;
	СообщениеОбъект.Код = ID;

	ДанныеСообщения 		= ПолучитьДанныеСообщения(ОбъектДляСериализации, ID, ТочкаПодключения);
	КонтейнерСообщения 		= СериализоватьОбъект(ДанныеСообщения);
	СообщениеОбъект.Данные 	= Новый ХранилищеЗначения(КонтейнерСообщения);
	
	СообщениеОбъект.Записать();
	
КонецПроцедуры	

Функция ПолучитьДанныеСообщения(ОбъектДляСериализации, ID, ТочкаПодключения) 
	
	ДанныеСообщения = Новый Структура; 
	ДанныеСообщения.Вставить("ID", 		ID);
	ДанныеСообщения.Вставить("Type", 	ТочкаПодключения.ТипСообщения);
			
	МенеджерыКонвертации 	= СоздатьМенеджерыКонвертации();
	МенеджерКонвертации 	= МенеджерыКонвертации.Получить(ТочкаПодключения.СпособСериализации);
	
	Если МенеджерКонвертации = Неопределено Тогда
		ОбъектДляУпаковки = ОбъектДляСериализации; // специально не преобразуем объект
	Иначе	
		ОбъектДляУпаковки = МенеджерыКонвертации.ВыполнитьМетод(ТочкаПодключения.ИмяМетодаСериализации, ОбъектДляСериализации);
	КонецЕсли;
	
	ДанныеСообщения.Вставить("Content", ОбъектДляУпаковки);
	
	//СформироватьСтруктуруСообщения(ДанныеСообщения, ОбъектДляУпаковки, ТочкаПодключения);
	Возврат ДанныеСообщения;
	
КонецФункции

Функция ЗаписатьОбъектВJSON(ОбъектДляСериализации)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектДляСериализации);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции	

Функция СериализоватьОбъект(ОбъектДляСериализации)
	
	// пока только JSON, потом, возможно, будет больше
	Возврат ЗаписатьОбъектВJSON(ОбъектДляСериализации);
	
КонецФункции

Функция ДесериализоватьОбъект(Данные)
	
	// пока только JSON, потом, возможно, будет больше
	Возврат ПрочитатьОбъектИзJSON(Данные);
	
КонецФункции	

Функция ПрочитатьОбъектИзJSON(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
	Возврат СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции

// возможно, удалить эту процедуру
Процедура СформироватьСтруктуруСообщения(ДанныеСообщения, ОбъектДляСериализации, ТочкаПодключения)
	
	ИДСообщения = Строка(Новый УникальныйИдентификатор);
	
	ДанныеСообщения.Вставить("ID", 		ДанныеСообщения.ID);
	ДанныеСообщения.Вставить("Type", 	ТочкаПодключения.ТипСообщения);
	ДанныеСообщения.Вставить("Content", ОбъектДляСериализации);
	
КонецПроцедуры

Функция ПолучитьСтруктуруОбъектаЧерезМенеджер(Знач ОбъектДляСериализации, ТочкаПодключения)
	
	Если ТочкаПодключения.СпособСериализации = ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодВстроенногоМенеджера") Тогда
		МенеджерКонвертации = Обработки.рмкМенеджерКонвертации.Создать();	
	ИначеЕсли ТочкаПодключения.СпособСериализацииОбъекта = ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодПодключаемогоМенеджера") Тогда
		
		ПодключитьВнешнююОбработкуМенеджераКонвертации();
		МенеджерКонвертации = ВнешниеОбработки.рмкМенеджерКонвертации.Создать();			
				
	Иначе
		ВызватьИсключение "Неправильный тип сериализации в точке";
	КонецЕсли;
	
	МенеджерКонвертации.ВыполнитьМетод(ОбъектДляСериализации, ТочкаПодключения.ИмяМетодаСериализации);
	
	Возврат ОбъектДляСериализации;
	
КонецФункции

Функция ПодключаемыйМенеджерКонвертацииСуществует()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.рмкХранилищеПодключаемогоМенеджераКонвертации.Получить().Получить() <> Неопределено;
	
КонецФункции	

Процедура ПодключитьВнешнююОбработкуМенеджераКонвертации()
	
	ДвоичныеДанныеОбработки = Константы.рмкХранилищеПодключаемогоМенеджераКонвертации.Получить().Получить();
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("epf");
	ДвоичныеДанныеОбработки.Записать(ИмяВременногоФайла);
	ВнешниеОбработки.Подключить(ИмяВременногоФайла, "рмкМенеджерКонвертации", Ложь);
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

Функция СоздатьМенеджерыКонвертации()
	
	Менеджеры = Новый Соответствие;
	Менеджеры.Вставить(ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодВстроенногоМенеджера"), Обработки.рмкМенеджерКонвертации.Создать());
	
	Если ПодключаемыйМенеджерКонвертацииСуществует() Тогда
	
		ПодключитьВнешнююОбработкуМенеджераКонвертации();
		Менеджеры.Вставить(ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.МетодВстроенногоМенеджера"), ВнешниеОбработки.рмкМенеджерКонвертации.Создать());
		
	КонецЕсли;
	
	//Менеджеры.Вставить(ПредопределенноеЗначение("Перечисление.рмкСпособыСериализации.ПлатформеннаяСериализация"), Обработки.рмкМенеджерПлатформеннойСериализации.Создать());
	
	Возврат Менеджеры;
	
КонецФункции		

Функция ПолучитьМенеджерКонвертации(Менеджеры, СпособСериализации)
	
	МенеджерКонвертации = Менеджеры.Получить(СпособСериализации);
	
	Если МенеджерКонвертации = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Не инициализирован менеджер конвертации для способа %1", СпособСериализации);
	КонецЕсли;
	
	Возврат МенеджерКонвертации;
	
КонецФункции	

Процедура ЗафиксироватьСтатусСообщения(Сообщение, СтатусСтрокой, ТекстСообщения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.рмкСтатусыСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сообщение 		= Сообщение;
	МенеджерЗаписи.Идентификатор 	= Новый УникальныйИдентификатор;
	МенеджерЗаписи.Статус 			= ПредопределенноеЗначение("Перечисление.рмкСтатусыСообщений." + СтатусСтрокой);
	МенеджерЗаписи.Информация 		= ТекстСообщения;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
